# ThermalMaterialParamElectricalResistivity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamElectricalResistivity Property
ParameterTypeId Class See Also
---
"Electrical Resistivity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamElectricalResistivity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamElectricalResistivity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamElectricalResistivity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace